# RebarSystemLayers Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
GroupTypeId..::..RebarSystemLayers Property
GroupTypeId Class See Also
---
Layers.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public static ForgeTypeId RebarSystemLayers { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RebarSystemLayers As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RebarSystemLayers {
	ForgeTypeId^ get ();
}
```

# See Also
GroupTypeId Class
Autodesk.Revit.DB Namespace